# AddProfile Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..AddProfile Method
Form Class See Also
---
Add a profile into the form, by a specified edge/param.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int AddProfile(
	Reference edgeReference,
	double param
)
```

Visual Basic
---
```text
Public Function AddProfile ( _
	edgeReference As Reference, _
	param As Double _
) As Integer
```

Visual C++
---
```text
public:
int AddProfile(
	Reference^ edgeReference,
	double param
)
```

# ### Parameters
edgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe geometry reference of edge.
param
    Type: System..::..DoubleThe param on edge to specify the location.
# ### Return Value
Index of newly created profile.
# See Also
Form Class
Autodesk.Revit.DB Namespace